In [2]:
import numpy as np
import pandas as pd

### 1. Load the countries.csv directly via URL import into your panda data frame!

In [4]:
path_to_file = 'https://raw.githubusercontent.com/edlich/eternalrepo/master/DS-WAHLFACH/countries.csv'
data = pd.read_csv(path_to_file)
data

       Name     People     Area   BIP Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

### 2. Display some basic information as rows, columns and some basic statistical info.

In [69]:
# print column
print(data['Name'])

# print row
print(data.iloc[2])

# statistics of the column people
data['People'].describe()

0     Germany
1       Japan
2      Canada
3       Italy
4    Brazilia
Name: Name, dtype: object
Name          Canada
People      36503097
Area         9984670
BIP             1529
Currency         CAD
Name: 2, dtype: object

count    5.000000e+00
mean     1.027863e+08
std      6.759970e+07
min      3.650310e+07
25%      6.050172e+07
50%      8.252165e+07
75%      1.260450e+08
max      2.083600e+08
Name: People, dtype: float64

### 3. Show the last 4 rows of the data frame.

In [70]:
data.tail(3)

       Name     People     Area   BIP Currency
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

### 4. Show all the row of countries who have the EURO

In [71]:
data.loc[data['Currency'] == 'EUR']

      Name    People    Area   BIP Currency
0  Germany  82521653  357385  3466      EUR
3    Italy  60501718  301338  1850      EUR

### 5. Show only name and Currency in a new data frame

In [72]:
newData = data.drop(['People', 'Area', 'BIP'], axis=1)
newData

       Name Currency
0   Germany      EUR
1     Japan      YEN
2    Canada      CAD
3     Italy      EUR
4  Brazilia     REAL

### 6. Show only the rows/countries that have more than 2000 BIP (it is in Milliarden USD Bruttoinlandsprodukt)

In [96]:
data.loc[data['BIP'] > 2000]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN

### 7. Select all countries where with inhabitants between 50 and 150 Mio

In [85]:
data.loc[(data['People'] >= 50000000) & (data['People'] <= 150000000)]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN
3    Italy   60501718  301338  1850      EUR

### 8. Change BIP to Bip

In [75]:
data.rename(columns={'BIP': 'Bip'})

       Name     People     Area   Bip Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

### 9. Calculate the Bip sum

In [76]:
data['BIP'].sum()

13581

### 10. Calculate the average people of all countries

In [77]:
data['People'].mean()

102786293.6

### 11. Sort by name alphabetically

In [124]:
sortedData = data.sort_values(by=['Name'])
sortedData

      Name     People    Area   BIP Currency
2      BIG        BIG     BIG   BIG      BIG
4      BIG        BIG     BIG   BIG      BIG
0  Germany   82521653  357385  3466      EUR
3    Italy   60501718  301338  1850      EUR
1    Japan  126045000  377835  4938      YEN

### 12. Create a new data frame from the original where the area is changed as follows: all countries with > 1000000 get BIG and <= 1000000 get SMALL in the cell replaced

In [142]:
data['Area'] = np.where(data['Area'] > 1000000, 'BIG', 'SMALL')
data

       Name     People   Area   BIP Currency
0   Germany   82521653  SMALL  3466      EUR
1     Japan  126045000  SMALL  4938      YEN
2    Canada   36503097    BIG  1529      CAD
3     Italy   60501718  SMALL  1850      EUR
4  Brazilia  208360000    BIG  1798     REAL